# Housing Market

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows:
###### The first a random number from 1 to 4
###### The second a random number from 1 to 3
###### The third a random number from 10,000 to 30,000

In [3]:
s1=pd.Series(np.random.randint(1, high=5, size=100,dtype='l'))
s2=pd.Series(np.random.randint(1,high=4, size=100, dtype='l'))
s3=pd.Series(np.random.randint(10000,high=30001, size=100, dtype='l'))
print(s1,s2,s3)

0     2
1     2
2     4
3     2
4     4
     ..
95    4
96    3
97    1
98    2
99    1
Length: 100, dtype: int32 0     3
1     2
2     1
3     3
4     1
     ..
95    1
96    1
97    2
98    3
99    1
Length: 100, dtype: int32 0     18553
1     21863
2     11415
3     19106
4     28910
      ...
95    17069
96    13669
97    17328
98    22191
99    21244
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
housemkt=pd.concat([s1,s2,s3],axis=1)
housemkt.head()

   0  1      2
0  2  3  18553
1  2  2  21863
2  4  1  11415
3  2  3  19106
4  4  1  28910

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            18553
1      2       2            21863
2      4       1            11415
3      2       3            19106
4      4       1            28910

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
# join the values
bigcolumn=pd.concat([s1,s2,s3],axis=0)
#transform to a dataframe
bigcolumn=bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       4
3       2
4       4
..    ...
95  17069
96  13669
97  17328
98  22191
99  21244

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [9]:
len(bigcolumn)

300